run/cavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 273;

boundaryField
{
    top      
    {
        type            fixedValue;
        value           uniform 273;
    }

    right      
    {
        type            zeroGradient;
        value           uniform 273;
    }

    bottom      
    {
        type            zeroGradient;
        value           uniform 273;
    }
    left      
    {
        type            zeroGradient;
        value           uniform 273;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
