run/cavity/0/magVorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      magVorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
1000
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
1000
0
0
0
0
0
0
0
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
1000
0
0
0
0
0
0
0
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
2000
2000
2000
2000
2000
2000
2000
2000
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
