run/cavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


libs 		( "libDensityBasedSolvers.so" );

application     allSpeedUnsteadyFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         100;

deltaT          1e-2;

writeControl    runTime;//runTime;//timeStep;//adjustableRunTime;//

writeInterval    0.5;

purgeWrite      0;

writeFormat     ascii;//binary;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;


// ************************************************************************* //
// Switch for global time stepping, with global minimum localTS
adjustTimeStep  no;//yes;//

// maximimun CFL number for localTS
maxCo           0.1;//1000;//

// maxDeltaT - currently not used in Density-Based solvers
maxDeltaT       1;

// fixed the local time stepping in the sub time loop.
//deltaT_Local	deltaT_Local [ 0 0 1 0 0 0 0 ] 1e-3;
//deltaT_Local		1e-3;

// residual control dual time looping.
convergence_Res		0.0001;

// the fixed reference velocity in the paper.
//velocity_Inlet	velocity_Inlet [ 0 1 -1 0 0 0 0 ] 1;
velocity_Inlet		0.664;



